#+TITLE: Ltcwbb


* Useful commands:
jupyter-org-kill-block-and-results-and-ex

* Chapter 3

#+begin_src jupyter-python :session py
import pandas as pd
from os import path

DATA_DIR = '/home/richm/projects/python/baseball/data'

players = pd.read_csv(path.join(DATA_DIR, '2018-season','players.csv'))
players = players.set_index('playerID')
players.head
#+end_src

#+RESULTS:
#+begin_example
<bound method NDFrame.head of                         name bats throws  height  weight  birthYear  \
playerID
abreujo02         Jose Abreu    R      R    75.0   255.0       1987
acunaro01       Ronald Acuna    R      R    72.0   180.0       1997
adamewi01       Willy Adames    R      R    72.0   200.0       1995
adamsma01         Matt Adams    L      R    75.0   245.0       1988
adducji02         Jim Adduci    L      L    74.0   210.0       1985
...                      ...  ...    ...     ...     ...        ...
workmbr01    Brandon Workman    R      R    77.0   235.0       1988
wrighmi01        Mike Wright    R      R    78.0   215.0       1990
wrighst01      Steven Wright    R      R    74.0   215.0       1984
yarbrry01     Ryan Yarbrough    R      L    77.0   205.0       1991
zimmejo02  Jordan Zimmermann    R      R    74.0   225.0       1986

           birthMonth  birthDay      birthCity  birthState birthCountry  \
playerID
abreujo02           1        29     Cienfuegos  Cienfuegos         Cuba
acunaro01          12        18      La Guaira      Vargas    Venezuela
adamewi01           9         2       Santiago    Santiago         D.R.
adamsma01           8        31    Philipsburg          PA          USA
adducji02           5        15        Burnaby          BC          CAN
...               ...       ...            ...         ...          ...
workmbr01           8        13      Arlington          TX          USA
wrighmi01           1         3  Bennettsville          SC          USA
wrighst01           8        30       Torrance          CA          USA
yarbrry01          12        31       Lakeland          FL          USA
zimmejo02           5        23     Auburndale          WI          USA

              debut
playerID
abreujo02  20140331
acunaro01  20180425
adamewi01  20180522
adamsma01  20120520
adducji02  20130901
...             ...
workmbr01  20130710
wrighmi01  20150517
wrighst01  20130423
yarbrry01  20180331
zimmejo02  20090420

[825 rows x 12 columns]>
#+end_example

#+begin_src jupyter-python :session py :async no
players.shape
#+end_src

#+RESULTS:
| 825 | 12 |

#+begin_src jupyter-python :session py
players[['name', 'bats', 'throws','birthCountry']].head()
#+end_src

#+RESULTS:
:                    name bats throws birthCountry
: playerID
: abreujo02    Jose Abreu    R      R         Cuba
: acunaro01  Ronald Acuna    R      R    Venezuela
: adamewi01  Willy Adames    R      R         D.R.
: adamsma01    Matt Adams    L      R          USA
: adducji02    Jim Adduci    L      L          CAN

#+begin_src jupyter-python :session py
players.columns
#+end_src

#+RESULTS:
: Index(['name', 'bats', 'throws', 'height', 'weight', 'birthYear', 'birthMonth',
:        'birthDay', 'birthCity', 'birthState', 'birthCountry', 'debut'],
:       dtype='object')


#+begin_src jupyter-python :session py
players_cuba = players.loc[players['birthCountry'] == 'Cuba', ['name', 'height', 'weight', 'birthCountry']]
#+end_src

#+RESULTS:

#+begin_src jupyter-python :session py
players_cuba.head()
#+end_src

#+RESULTS:
:                       name  height  weight birthCountry
: playerID
: abreujo02       Jose Abreu    75.0   255.0         Cuba
: alonsyo01    Yonder Alonso    73.0   230.0         Cuba
: chapmar01  Aroldis Chapman    76.0   212.0         Cuba
: diazal02      Aledmys Diaz    73.0   195.0         Cuba
: gourryu01     Yuli Gurriel    72.0   190.0         Cuba


#+begin_src jupyter-python :session py
players_cuba['bats'] = players['bats']
#+end_src

#+RESULTS:

#+RESULTS:
:                       name  height  weight birthCountry bats
: playerID
: abreujo02       Jose Abreu    75.0   255.0         Cuba    R
: alonsyo01    Yonder Alonso    73.0   230.0         Cuba    L
: chapmar01  Aroldis Chapman    76.0   212.0         Cuba    L
: diazal02      Aledmys Diaz    73.0   195.0         Cuba    R
: gourryu01     Yuli Gurriel    72.0   190.0         Cuba    R


** Part 2, page 57

#+begin_src jupyter-python :session py
pp = pd.read_csv(path.join(DATA_DIR, '100-game-sample', 'pitches.csv'))
#+end_src

#+RESULTS:

#+RESULTS:
#+begin_example
             pitcher      batter  i  o  b  s pitch_type   mph  mph_max
0           S.Romano     A.Eaton  1  0  0  0         FT  95.4    105.1
1           S.Romano     A.Eaton  1  0  1  0         FT  95.0    105.1
2           S.Romano     A.Eaton  1  0  1  1         FT  89.9    105.1
3           S.Romano    A.Rendon  1  0  0  0         FT  95.2    105.1
4           S.Romano    A.Rendon  1  0  0  1         FT  95.4    105.1
...              ...         ... .. .. .. ..        ...   ...      ...
29611  N.Syndergaard  D.Dietrich  9  1  3  1         SI  97.3    105.1
29612  N.Syndergaard   P.O'Brien  9  2  0  0         CU  84.0    105.1
29613  N.Syndergaard   P.O'Brien  9  2  0  1         SL  91.5    105.1
29614  N.Syndergaard   P.O'Brien  9  2  1  1         SL  91.9    105.1
29615  N.Syndergaard   P.O'Brien  9  2  2  1         SI  98.0    105.1

[29616 rows x 9 columns]
#+end_example

3 main column types: number, string, boolean
figure out spin rate:
#+begin_src jupyter-python :session py
import numpy as np

pp['distance_from_middle_of_plate'] = np.abs(pp['x0'])

pp['ln_spin_rate'] = np.log(pp['spin_rate'])

pp.head()
#+end_src

#+RESULTS:
#+begin_example
        ab_id   pitcher    batter  i  b  s  o pitch_type   mph type  ...  \
0  2018003856  S.Romano   A.Eaton  1  0  0  0         FT  95.4    B  ...
1  2018003856  S.Romano   A.Eaton  1  1  0  0         FT  95.0    S  ...
2  2018003856  S.Romano   A.Eaton  1  1  1  0         FT  89.9    X  ...
3  2018003857  S.Romano  A.Rendon  1  0  0  0         FT  95.2    S  ...
4  2018003857  S.Romano  A.Rendon  1  0  1  0         FT  95.4    S  ...

  end_speed       g_id  b_score  pitcher_team  on_1b  on_2b  on_3b  \
0      87.2  201800050        0           CIN    0.0    0.0    0.0
1      86.7  201800050        0           CIN    0.0    0.0    0.0
2      82.8  201800050        0           CIN    0.0    0.0    0.0
3      86.0  201800050        0           CIN    1.0    0.0    0.0
4      86.3  201800050        0           CIN    1.0    0.0    0.0

   b_score_after_pitch  distance_from_middle_of_plate  ln_spin_rate
0                    0                       1.628619      7.963906
1                    0                       1.576306      7.929526
2                    0                       1.837934      7.745107
3                    0                       2.086613      7.947225
4                    0                       1.923722      8.006044

[5 rows x 31 columns]
#+end_example

#+begin_src jupyter-python :session py
pp['season'] = 2018

pp[['pitcher','batter','i', 'o','b','s','pitch_type','mph','season']].sample(5)
#+end_src

#+RESULTS:
:           pitcher     batter  i  o  b  s pitch_type   mph  season
: 17241      J.Gant     D.Bote  2  2  1  1         CH  82.6    2018
: 14198    A.Colome    J.Upton  8  2  1  0         FF  93.4    2018
: 19909     R.Lopez  M.Mahtook  4  2  0  0         FF  96.1    2018
: 29226  C.Stratton   D.Freese  4  0  2  0         FF  90.9    2018
: 29038     C.Allen  B.Goodwin  7  0  2  1         FF  91.5    2018

#+begin_src jupyter-python :session py
(pp['pitcher'] + ' throws a ' + pp['pitch_type'] + ' to ' + pp['batter']).sample(5)
#+end_src

#+RESULTS:
: 28749      T.Vieira throws a FF to C.Gimenez
: 9172       J.Shields throws a FF to C.Yelich
: 13155    J.Lucchesi throws a SI to A.Meadows
: 10192       M.Harvey throws a FT to L.Weaver
: 28200     N.Rumbelow throws a CH to J.Lowrie
: dtype: object

#+begin_src jupyter-python :session py :async yes
def is_fastball(pitch):
    """
    takes some string named pitch and checks whether it's a fastball
    (cutter, four seam, two seam, sinker, splitter)
    """
    return pitch in ['FC','FF','FS','FT','SI']
#+end_src

#+RESULTS:

#+begin_src jupyter-python :session py  :async yes
pp['is_fastball'] = pp['pitch_type'].apply(is_fastball)
#+end_src

#+RESULTS:

#+begin_src jupyter-python :session py :async yes
pp[['pitcher', 'is_fastball','pitch_type','mph']].sample(5)
#+end_src

#+RESULTS:
:            pitcher  is_fastball pitch_type   mph
: 909    V.Velasquez         True         FT  89.4
: 6253    C.Buchholz         True         FF  91.5
: 13094      S.Dyson         True         FT  90.7
: 7566   T.McFarland         True         SI  91.8
: 17395  K.Hendricks         True         SI  86.5

alternate lambda function

#+begin_src jupyter-python :session py :async yes
pp['is_fastball_alternate'] = pp['pitch_type'].apply(
    lambda x: x in ['FC','FF','FS','FT','SI'])
#+end_src

#+RESULTS:

#+begin_src jupyter-python :session py :async yes
pp.drop('is_fastball_alternate', axis=1, inplace=True)
#+end_src

#+RESULTS:

#+begin_src jupyter-python :session py :async yes
pp.columns = [x.lower() for x in pp.columns]

pp.head()
#+end_src

#+RESULTS:
#+begin_example
        ab_id   pitcher    batter  i  b  s  o pitch_type   mph type  ...  \
0  2018003856  S.Romano   A.Eaton  1  0  0  0         FT  95.4    B  ...
1  2018003856  S.Romano   A.Eaton  1  1  0  0         FT  95.0    S  ...
2  2018003856  S.Romano   A.Eaton  1  1  1  0         FT  89.9    X  ...
3  2018003857  S.Romano  A.Rendon  1  0  0  0         FT  95.2    S  ...
4  2018003857  S.Romano  A.Rendon  1  0  1  0         FT  95.4    S  ...

  b_score  pitcher_team  on_1b  on_2b  on_3b  b_score_after_pitch  \
0       0           CIN    0.0    0.0    0.0                    0
1       0           CIN    0.0    0.0    0.0                    0
2       0           CIN    0.0    0.0    0.0                    0
3       0           CIN    1.0    0.0    0.0                    0
4       0           CIN    1.0    0.0    0.0                    0

   distance_from_middle_of_plate  ln_spin_rate  season  is_fastball
0                       1.628619      7.963906    2018         True
1                       1.576306      7.929526    2018         True
2                       1.837934      7.745107    2018         True
3                       2.086613      7.947225    2018         True
4                       1.923722      8.006044    2018         True

[5 rows x 33 columns]
#+end_example

page 65


#+begin_src jupyter-python :session py :async yes
players = pd.read_csv(path.join(DATA_DIR, '2018-season', 'players.csv'))
#+end_src

#+RESULTS:

#+RESULTS:
#+begin_example
0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9    False
Name: birthState, dtype: bool
#+end_example


#+begin_src jupyter-python :session py :async yes
players[['name', 'birthCity', 'birthState', 'birthCountry']].head(10)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_src jupyter-python :session py :async yes
players['birthState'].notnull().head(10)
#+end_src

#+RESULTS:
#+begin_example
0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: birthState, dtype: bool
#+end_example

#+begin_example
              name    birthCity  birthState birthCountry
0       Jose Abreu   Cienfuegos  Cienfuegos         Cuba
1     Ronald Acuna    La Guaira      Vargas    Venezuela
2     Willy Adames     Santiago    Santiago         D.R.
3       Matt Adams  Philipsburg          PA          USA
4       Jim Adduci      Burnaby          BC          CAN
5   Ehire Adrianza     Guarenas     Miranda    Venezuela
6    Jesus Aguilar      Maracay      Aragua    Venezuela
7       Nick Ahmed  Springfield          MA          USA
8     Ozzie Albies   Willemstad         NaN      Curacao
9  Scott Alexander   Santa Rosa          CA          USA
#+end_example
:END:
#+RESULTS:
#+begin_example
0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: birthState, dtype: bool
#+end_example
#+begin_src jupyter-python :session py :async yes
players['birthState'].fillna('Country has no states').head(10)
#+end_src

#+RESULTS:
#+begin_example
0               Cienfuegos
1                   Vargas
2                 Santiago
3                       PA
4                       BC
5                  Miranda
6                   Aragua
7                       MA
8    Country has no states
9                       CA
Name: birthState, dtype: object
#+end_example

#+begin_src jupyter-python :session py :async yes
players.dtypes.head()
#+end_src

#+RESULTS:
:RESULTS:
#+begin_src jupyter-python :session py :async y
atbats = pd.read_csv(path.join(DATA_DIR, '2018-season','atbats.csv'))
atbats.mean()
#+end_src

#+RESULTS:
#+begin_example
year     2018.000000
stint       1.028409
G          98.515152
AB        275.797348
R          37.092803
H          70.223485
2B         14.202652
3B          1.458333
HR          9.717803
RBI        35.403409
SB          4.297348
CS          1.674242
BB         26.863636
SO         65.632576
IBB         1.693182
HBP         3.335227
SH          0.704545
SF          2.109848
GIDP        5.789773
dtype: float64
#+end_example

: name       object
: bats       object
: throws     object
: height    float64
: weight    float64
: dtype: object
:END:
#+RESULTS:
#+begin_example
year     2018.000000
stint       1.028409
G          98.515152
AB        275.797348
R          37.092803
H          70.223485
2B         14.202652
3B          1.458333
HR          9.717803
RBI        35.403409
SB          4.297348
CS          1.674242
BB         26.863636
SO         65.632576
IBB         1.693182
HBP         3.335227
SH          0.704545
SF          2.109848
GIDP        5.789773
dtype: float64
#+end_example

#+begin_src jupyter-python :session py :async yes
atbats.max()
#+end_src

#+RESULTS:
#+begin_example
name        Zack Cozart
year               2018
stint                 2
team                WAS
lg                   NL
G                   162
AB                  664
R                   129
H                   192
2B                   51
3B                   12
HR                   48
RBI                 130
SB                   45
CS                   14
BB                  130
SO                  217
IBB                  25
HBP                  22
SH                   12
SF                   11
GIDP                 23
playerID      zuninmi01
dtype: object
#+end_example

#+begin_src jupyter-python :session py :async yes
atbats.min()
#+end_src

#+RESULTS:
#+begin_example
name        A. J. Ellis
year               2018
stint                 1
team                ARI
lg                   AL
G                    50
AB                    0
R                     0
H                     0
2B                    0
3B                    0
HR                    0
RBI                   0
SB                    0
CS                    0
BB                    0
SO                    0
IBB                   0
HBP                   0
SH                    0
SF                    0
GIDP                  0
playerID      abreujo02
dtype: object
#+end_example


#+begin_src jupyter-python :session py :async yes
atbats['1B'] = (atbats['H'] - atbats[['2B','3B','HR']].sum(axis=1))
atbats[['name', '1B']].sample(5)
#+end_src

#+RESULTS:
:                name   1B
: 84      Curt Casali   27
: 440     Jean Segura  136
: 159    Adam Frazier   53
: 445        JB Shuck   21
: 127  Derek Dietrich   88

#+begin_src jupyter-python :session py :async yes
pp = pd.read_csv(path.join(DATA_DIR, '100-game-sample', 'pitches.csv'))
pp.dtypes.head()
#+end_src

#+RESULTS:
: ab_id       int64
: pitcher    object
: batter     object
: i           int64
: b           int64
: dtype: object


#+begin_src jupyter-python :session py :async yes
pp['fast_4seam'] = (pp['pitch_type'] == 'FF') & (pp['mph'] >= 100)
pp['fast_4seam'].mean()
pp['fast_4seam'].sum()
#+end_src

#+RESULTS:
: 20
#+begin_src jupyter-python :session py :async yes
(pp['mph'] > 104).any()
#+end_src

#+RESULTS:
: True
#+begin_src jupyter-python :session py :async yes
(atbats[['H', 'SO']] > 150).all(axis=1).sum()
#+end_src

#+RESULTS:
: 6

#+begin_src jupyter-python :session py :async yes
pp['pitch_type'].value_counts(normalize=True)
#+end_src

#+RESULTS:
#+begin_example
FF    0.360000
SL    0.174771
CH    0.104618
FT    0.101460
CU    0.085059
SI    0.078268
FC    0.060000
KC    0.022003
FS    0.012835
EP    0.000509
PO    0.000374
FO    0.000102
Name: pitch_type, dtype: float64
#+end_example

#+begin_src jupyter-python :session py :async yes
pd.crosstab(pp['i'], pp['pitch_type']).head(9)
#+end_src

#+RESULTS:
#+begin_example
pitch_type   CH   CU  EP   FC    FF  FO  FS   FT  KC  PO   SI   SL
i
1           332  269   0  200  1431   0  38  451  76   0  209  473
2           348  319   0  171  1191   0  37  373  84   0  205  500
3           423  324   1  206  1115   0  28  363  76   4  178  545
4           425  285   4  200  1067   0  33  414  89   1  156  549
5           406  320   6  202  1046   0  40  366  67   2  229  570
6           346  297   3  148  1129   0  44  344  68   0  294  697
7           282  219   1  205  1153   3  76  214  56   2  444  669
8           274  275   0  211  1313   0  51  234  56   0  261  650
9           223  136   0  204  1009   0  31  171  74   2  244  406
#+end_example

*Page 77*

#+begin_src jupyter-python :session py :async yes

#+end_src
